InformationRegisters/КонтактнаяИнформация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>КонтактнаяИнформация</Name>
			<Comment>Контактная информация контрагентов, контактных лиц, организаций и сотрудников</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Comment>Признак значения по умолчанию</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Произвольный комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле1</Name>
					<Comment>Вспомогательное поле: "Код страны" или "Индекс"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле2</Name>
					<Comment>Вспомогательное поле: "Код города" или "Регион"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле3</Name>
					<Comment>Вспомогательное поле: "Номер телефона" или "Район"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле4</Name>
					<Comment>Вспомогательное поле: "Внутренний (или добавочный)  номер" или "Город"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле5</Name>
					<Comment>Вспомогательное поле: "Населенный пункт"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле6</Name>
					<Comment>Вспомогательное поле: "Улица"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле7</Name>
					<Comment>Вспомогательное поле: "Дом"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле8</Name>
					<Comment>Вспомогательное поле: "Корпус"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле9</Name>
					<Comment>Вспомогательное поле: "Квартира"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Comment>Строковое представление контактной информации</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле10</Name>
					<Comment>Вспомогательное поле: "Подъезд"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле11</Name>
					<Comment>Вспомогательное поле: "Этаж"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле12</Name>
					<Comment>Вспомогательное поле: "Код двери/домофон"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтанцияМетро</Name>
					<Comment>Станция метро</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтанцииМетро</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГородскойРайон</Name>
					<Comment>Городской район проживания</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Районы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>CRM_ПолеХраненияНомера</Name>
					<Comment>Индексирование тел. номера для поиска</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>31</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипДома</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДомов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКорпуса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКорпусов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКвартир</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КраткоеПредставление</Name>
					<Comment>Краткое представление</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект-владелец контактной информации</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияГК</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Comment>Тип контактной информации</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Comment>Вид контактной информации</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
			<Comment>Типы контактной информации</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
					<Comment>Телефон</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
					<Comment>Адрес</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Comment>E-Mail</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
					<Comment>Веб-страница</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НомерICQ</Name>
					<Comment>Номер ICQ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
					<Comment>Другая контактная информация (произвольная)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>GoogleАккаунт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/Renault_Открытый/Ext/Module.bsl
#Если наКлиенте тогда
Процедура Меню_ICM(Автомобиль = Неопределено, Пробег = неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Автомобиль) тогда
		ЗапуститьПриложение("https://dcs.renault.com/icm/jsp/ServletLogin");
	Иначе
		VIN = Автомобиль.VIN;
		ЗапуститьПриложение("https://dcs.renault.com/icm/jsp/ServletLogin?VIN="+VIN+"&KM="+Формат(Пробег,"ЧДЦ=0; ЧГ="));
	КонецЕсли;
	
КонецПроцедуры

Процедура Меню_ICM_Интерфейс() Экспорт
	//К+
	Отказ = НЕ Renault_РаботаСПравамиПользователя.ЕстьПравоНаРаботуСоСлужебнымиФункциямиRenault();
	Если Отказ Тогда
		Возврат;
	КонецЕсли;	
	//К- 
	
	ЗапуститьПриложение("https://dcs.renault.com/icm/jsp/ServletLogin");
КонецПроцедуры

Функция Меню_Поддержка() Экспорт
	
	Если ПараметрыСеанса.DMS_Бренд=Справочники.CRM_МаркаАвтомобиля.LADA Тогда
		ЗапуститьПриложение("https://dmsweb.vaz.ru/RegistrateSupport");
	ИначеЕсли ПараметрыСеанса.DMS_Бренд=Справочники.CRM_МаркаАвтомобиля.RENAULT Тогда
		ЗапуститьПриложение("http://dms.renault.ru/support");
	КонецЕсли;
	
КонецФункции

Функция Меню_Инструкции() Экспорт
	
	Если ПараметрыСеанса.DMS_Бренд=Справочники.CRM_МаркаАвтомобиля.LADA Тогда
		//ЗапуститьПриложение("https://dmsweb.vaz.ru/RegistrateSupport");
	ИначеЕсли ПараметрыСеанса.DMS_Бренд=Справочники.CRM_МаркаАвтомобиля.RENAULT Тогда
		ЗапуститьПриложение("http://confluence.rnlt.ru/pages/viewpage.action?pageId=42631438");
	КонецЕсли;
	
КонецФункции

Функция Меню_DMSPortal() Экспорт
	Если ПараметрыСеанса.DMS_Бренд=Справочники.CRM_МаркаАвтомобиля.RENAULT Тогда
		ЗапуститьПриложение("http://jira.rnlt.ru/servicedesk/customer/portal/13");
	КонецЕсли;	
КонецФункции

Функция Меню_ПорталDMS() Экспорт
	//ЗапуститьПриложение("http://dcs.renault.com/icm/jsp/ServletLogin");
КонецФункции

#КонецЕсли

#Если наКлиенте И ТолстыйКлиентОбычноеПриложение Тогда

Функция ПодсистемаСодержитКонстанту(ИмяПодсистемы, МетаКонстанты)
	
	КорневаяПодсистема = Метаданные.Подсистемы.Найти(ИмяПодсистемы);
	
	Возврат НайтиРекурсивно(КорневаяПодсистема, МетаКонстанты);
	
КонецФункции

Функция НайтиРекурсивно(КорневаяПодсистема, МетаКонстанты)
	
	Результат = Ложь;
	Если КорневаяПодсистема.Состав.Содержит(МетаКонстанты) Тогда
		Возврат Истина;
	Иначе
		Для Каждого Подсистема ИЗ КорневаяПодсистема.Подсистемы Цикл
			Результат = НайтиРекурсивно(Подсистема, МетаКонстанты);
			Если Результат = Истина Тогда
				Возврат Результат;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПроверкаКонстанты(Константа) Экспорт
	
	Если ТипЗнч(Константа) = Тип("ОбъектМетаданных") Тогда
		МетаКонстанты = Константа;
	Иначе
		МетаКонстанты = Константа.СоздатьМенеджерЗначения().Метаданные();
	КонецЕсли;
	
	Если ПодсистемаСодержитКонстанту("DMS", МетаКонстанты) Тогда
		Возврат (МетаКонстанты.ПроверкаЗаполнения = ПроверкаЗаполнения.НеПроверять); 
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

#КонецЕсли

////@+ Процедура СостояниеДляПользователя(ТекстСостояния)
//Дата создания - 23.04.2012 11:40:58; Автор - Окипний Андрей Евгеньевич
// 
// Описание процедуры
//  Процедура меняет строку состояния системы для клиентского режима.
//
// Параметры
//  ТекстСостояния  - Строка - Строка состояния, которое нужно вернуть пользователю
//                 <продолжение описания параметра>
//@-
Процедура СостояниеДляПользователя(ТекстСостояния) Экспорт

	// Комментарий 
	//Дата создания - 23.04.2012 11:43:06; Автор - Окипний Андрей Евгеньевич
	//на стороне сервера ничего не делаем.
	//
	#Если наКлиенте тогда
	Состояние(ТекстСостояния);
	#Иначе
	Возврат
	#КонецЕсли
	
КонецПроцедуры // СостояниеДляПользователя(ТекстСостояния)

////@+ Процедура УстановитьМакетПостроителя(Построитель)
//Дата создания - 23.04.2012 12:11:34; Автор - Окипний Андрей Евгеньевич
// 
// Описание процедуры
//  Процедура устанавливаем макет построителю отчетов если это клиентская сессия
//  Если сессия серверная ничего не происходит
//
// Параметры
//  Построитель  - Объект.ПостроительОтчета - Ссылка на созданный объект построителя отчетов
//
//@-
Процедура УстановитьМакетПостроителя(Построитель) Экспорт
	
	// Комментарий 
	//Дата создания - 23.04.2012 12:14:29; Автор - Окипний Андрей Евгеньевич
	//на стороне сервера ничего не делаем.
	//
	#Если наКлиенте И ТолстыйКлиентОбычноеПриложение Тогда
	Построитель.МакетОформления = ПолучитьМакетОформления(СтандартноеОформление.Медь);
	#Иначе
	Возврат; 
	#КонецЕсли
	
КонецПроцедуры // УстановитьМакетПостроителя(Построитель)

////@+ Процедура ПредупреждениеДляПользователя(Сообщение)
//<xml version="1.0" encoding="UTF-8">
//<Автодок>
//<Процедура ТипПроцедуры="Экспорт"
//           ИнструкцииПрепроцессору=""
//           ДатаCоздания="19.03.2013 14:30:13" Автор="Окипний Андрей Евгеньевич">
// <Имя>ПредупреждениеДляПользователя(Сообщение) </Имя>
//
// <Описание>
//  Процедура выдает предупреждение для клиентского режима.
// </Описание>
// <Параметры>
//  <Параметр> 
//  <ИмяПараметра>Сообщение</ИмяПараметра>
//  	<ТипПараметра>Строка(0)</ТипПараметра>
//  	<ОписаниеПараметра>Сообщение, которое необходимо отобразить пользователю</ОписаниеПараметра>
//  </Параметр>
// </Параметры>
//</Процедура>
//</Автодок>
//</xml>
//@-
Процедура ПредупреждениеДляПользователя(Сообщение) Экспорт
	
	// Комментарий 
	//Дата создания - 19.03.2013 14:32:40; Автор - Окипний Андрей Евгеньевич
	//
	//на стороне сервера ничего не делаем.
	//
	#Если наКлиенте тогда
	Предупреждение(Сообщение);
	#Иначе
	Возврат 
	#КонецЕсли
	
КонецПроцедуры // ПредупреждениеДляПользователя(Сообщение)

Функция ЭтоВебКлиент() Экспорт
	
	#Если ВебКлиент Тогда
	Возврат Истина;
	#Иначе
	Возврат Ложь;
	#КонецЕсли

КонецФункции

////@+ Функция  ПолучитьАдресВебСервисовПоУмолчанию()
//<xml version="1.0" encoding="UTF-8">
//<Автодок>
//<Функция ТипФункции="Экспорт"
//         ИнструкцииПрепроцессору=""
//         ДатаCоздания="09.07.2013 12:29:17" Автор="Окипний Андрей Евгеньевич">
// <Имя> ПолучитьАдресВебСервисовПоУмолчанию()</Имя>
//
// <Описание>
//  <!-- Вставить описание -->
// </Описание>
//
// </Параметры>
//  <!-- Без параметров -->
//
//  <Результат>
//  	<ИмяРезультата>АдресВебСервисов</ИмяРезультата>
//  	<ТипРезультата>Строка</ТипРезультата>
//  	<ОписаниеРезультата>Возвращает дефолтный адрес сервера</ОписаниеРезультата>
//  </Результат>
//</Функция>
//</Автодок>
//</xml>
//@-
Функция  ПолучитьАдресВебСервисовПоУмолчанию() Экспорт
	
	Возврат "http://gate.rnlt.ru/renault-webservices/";
	
КонецФункции //  ПолучитьАдресВебСервисовПоУмолчанию()

////@+ Функция ПолучитьЛогинСервисовПоУмолчанию()
//<xml version="1.0" encoding="UTF-8">
//<Автодок>
//<Функция ТипФункции="Экспорт"
//         ИнструкцииПрепроцессору=""
//         ДатаCоздания="09.07.2013 14:17:36" Автор="Окипний Андрей Евгеньевич">
// <Имя>ПолучитьЛогинСервисовПоУмолчанию()</Имя>
//
// <Описание>
//  <!-- Вставить описание -->
// </Описание>
//
// </Параметры>
//  <!-- Без параметров -->
//
//  <Результат>
//  	<ИмяРезультата>ЛогинWS</ИмяРезультата>
//  	<ТипРезультата><!-- Укажите тип возвращаемого параметра --></ТипРезультата>
//  	<ОписаниеРезультата><!-- описание результата -->
//                 <!-- продолжение описания результата --></ОписаниеРезультата>
//  </Результат>
//</Функция>
//</Автодок>
//</xml>
//@-
Функция ПолучитьЛогинСервисовПоУмолчанию() Экспорт
	
	Возврат "userWS";
	
КонецФункции // ПолучитьЛогинСервисовПоУмолчанию()

////@+ Функция ПолучитьПарольСервисовПоУмолчанию()
//<xml version="1.0" encoding="UTF-8">
//<Автодок>
//<Функция ТипФункции="Экспорт"
//         ИнструкцииПрепроцессору=""
//         ДатаCоздания="09.07.2013 14:18:52" Автор="Окипний Андрей Евгеньевич">
// <Имя>ПолучитьПарольСервисовПоУмолчанию()</Имя>
//
// <Описание>
//  <!-- Вставить описание -->
// </Описание>
//
// </Параметры>
//  <!-- Без параметров -->
//
//  <Результат>
//  	<ИмяРезультата>ПарольWS</ИмяРезультата>
//  	<ТипРезультата><!-- Укажите тип возвращаемого параметра --></ТипРезультата>
//  	<ОписаниеРезультата><!-- описание результата -->
//                 <!-- продолжение описания результата --></ОписаниеРезультата>
//  </Результат>
//</Функция>
//</Автодок>
//</xml>
//@-
Функция ПолучитьПарольСервисовПоУмолчанию() Экспорт
	
	Возврат "userWS";
	
КонецФункции // ПолучитьПарольСервисовПоУмолчанию()

#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
////@+ Процедура СообщитьПользователю(Сообщение)
//Дата создания - 23.04.2012 11:05:32; Автор - Окипний Андрей Евгеньевич
// 
// Описание процедуры
//  <Вставить описание>
//
// Параметры
//  Сообщение  - Строка - Сообщение, которое нужно отправить пользователю
//
//@-
Процедура СообщитьПользователю(Сообщение, 
	Статус = неопределено, 
	СобытиеДляЖурнала = Неопределено,
	УровеньДляЖурнала = Неопределено,
	ОбъектДляЖурнала = Неопределено,
	ДанныеДляЖурнала = Неопределено ) Экспорт
	
	// Комментарий 
	//Дата создания - 23.04.2012 11:06:19; Автор - Окипний Андрей Евгеньевич
	//на стороне сервера ничего не делаем.
	//
	#Если наКлиенте тогда
	Сообщить(Сообщение, Статус);
	#Иначе
	Если СобытиеДляЖурнала = неопределено тогда
		СобытиеДляЖурнала = "Не передано";
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации(СобытиеДляЖурнала, УровеньДляЖурнала, ОбъектДляЖурнала, ДанныеДляЖурнала, Сообщение);
	
	#КонецЕсли
	
	
КонецПроцедуры // СообщитьПользователю(Сообщение)

Процедура СозданиеДокументовКонтактСКлиентом(СтруктураПараметров = Неопределено) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Renault_КампанииОтборы.Ссылка.Ссылка КАК Кампания,
		|	Renault_КампанииОтборы.Контрагент КАК Контрагент,
		|	Renault_КампанииОтборы.Автомобиль КАК Автомобиль
		|ИЗ
		|	Справочник.Renault_Кампании.Отборы КАК Renault_КампанииОтборы
		|ГДЕ
		|	Renault_КампанииОтборы.Ссылка.ДатаНачалаАктивности <= &ТекущаяДата
		|	И Renault_КампанииОтборы.Ссылка.ДатаОкончанияАктивности >= &ТекущаяДата
		|	И Renault_КампанииОтборы.Ссылка.ФлРазоваяКампания = ЛОЖЬ
		|
		|СГРУППИРОВАТЬ ПО
		|	Renault_КампанииОтборы.Контрагент,
		|	Renault_КампанииОтборы.Автомобиль,
		|	Renault_КампанииОтборы.Ссылка.Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	Кампания,
		|	Контрагент,
		|	Автомобиль";

	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗапросДок = Новый Запрос;
		ЗапросДок.Текст = 
			"ВЫБРАТЬ
			|	Renault_КонтактСКлиентом.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.Renault_КонтактСКлиентом КАК Renault_КонтактСКлиентом
			|ГДЕ
			|	Renault_КонтактСКлиентом.Кампания = &Кампания
			|	И Renault_КонтактСКлиентом.Контрагент = &Контрагент
			|	И Renault_КонтактСКлиентом.Автомобиль = &Автомобиль
			|
			|СГРУППИРОВАТЬ ПО
			|	Renault_КонтактСКлиентом.Ссылка
			|
			|УПОРЯДОЧИТЬ ПО
			|	Ссылка";

		ЗапросДок.УстановитьПараметр("Автомобиль", Выборка.Автомобиль);
		ЗапросДок.УстановитьПараметр("Кампания", Выборка.Кампания);
		ЗапросДок.УстановитьПараметр("Контрагент", Выборка.Контрагент);

		ВыборкаДок = ЗапросДок.Выполнить().Выбрать();
		Если ВыборкаДок.Следующий() Тогда
			Продолжить;
		КонецЕсли;
		Телефон="";
		Для СчВидКонт=1 По 3 Цикл
			ЗапросКонтакты = Новый Запрос;
			ЗапросКонтакты.Текст = "
			|ВЫБРАТЬ
			|	КонтактнаяИнформация.Представление КАК Представление
			|ИЗ
			|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
			|ГДЕ
			|	КонтактнаяИнформация.Объект = &Объект
			|	И КонтактнаяИнформация.Тип = &Тип
			|	И КонтактнаяИнформация.Вид = &Вид";
			
			ЗапросКонтакты.УстановитьПараметр("Объект",Выборка.Контрагент);
			Если СчВидКонт=1 Тогда
				ЗапросКонтакты.УстановитьПараметр("Тип",Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
				ЗапросКонтакты.УстановитьПараметр("Вид",Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыДомашний);
			Иначе
				ЗапросКонтакты.УстановитьПараметр("Тип",Перечисления.ТипыКонтактнойИнформации.Телефон);
				Если СчВидКонт=2 Тогда
					ЗапросКонтакты.УстановитьПараметр("Вид",Справочники.ВидыКонтактнойИнформации.ТелефонКонтактный);
				Иначе
					ЗапросКонтакты.УстановитьПараметр("Вид",Справочники.ВидыКонтактнойИнформации.ТелефонСотовый);
				КонецЕсли;
			КонецЕсли;
			ВыборкаКонтакты=ЗапросКонтакты.Выполнить().Выбрать();
			Если ВыборкаКонтакты.Следующий() Тогда
				Если СчВидКонт=1 Тогда
					АдресЭлектроннойПочты=СокрЛП(ВыборкаКонтакты.Представление);
				Иначе
					Телефон=Телефон+?(Телефон="","",", ")+СокрЛП(ВыборкаКонтакты.Представление);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла; 
		НовыйКонтакт=Документы.Renault_КонтактСКлиентом.СоздатьДокумент();
		НовыйКонтакт.Дата=ТекущаяДата();
		НовыйКонтакт.Автомобиль=Выборка.Автомобиль;
		НовыйКонтакт.Контрагент=Выборка.Контрагент;
		НовыйКонтакт.Кампания=Выборка.Кампания;
		НовыйКонтакт.Телефон=Телефон;
		НовыйКонтакт.АдресЭлектроннойПочты=АдресЭлектроннойПочты;
		НовыйКонтакт.Записать();
	КонецЦикла;
КонецПроцедуры

// Процедура формирует таблицу со всеми документами, в которых присутствует заданный контрагент.
//
// Параметры:
//  Ограничения – "Структура" - ограничения на формируемую таблицу.
//
// Возвращаемое значение:
//   ТаблицаЗначений - таблица с документами.
// 
Функция Renault_ПолучитьТаблицуДокументовКритерияОтбора(Ограничения=Неопределено) Экспорт
	Если Ограничения=Неопределено Тогда
		Ограничения = Новый Структура;
		Ограничения.Вставить("Контрагент", Справочники.Контрагенты.ПустаяСсылка());
	КонецЕсли;
	
	Запрос = Новый Запрос;
	СтруктураИсключений = Новый Структура("Контрагент,ВидДокументов,ДатаНачала,ДатаОкончания");
	МассивВидовДокументов = Неопределено;
	ДатаНачала            = Неопределено;
	ДатаОкончания         = Неопределено;
	
	Ограничения.Свойство("ВидДокументов",   МассивВидовДокументов);
	Ограничения.Свойство("ДатаНачала",      ДатаНачала);
	Ограничения.Свойство("ДатаОкончания",   ДатаОкончания);

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	КритерийОтбораКонтрагенты.Документ КАК Документ,
	|	КритерийОтбораКонтрагенты.Дата КАК Дата,
	|	КритерийОтбораКонтрагенты.ХозОперация КАК ХозОперация,
	|	КритерийОтбораКонтрагенты.СуммаДокумента КАК СуммаДокумента,
	|	КритерийОтбораКонтрагенты.ВалютаДокумента КАК ВалютаДокумента,
	|	КритерийОтбораКонтрагенты.ДанныеКартинки КАК ДанныеКартинки
	|ИЗ (
	|		ВЫБРАТЬ
	|			Контрагенты.Ссылка КАК Документ,
	|			Контрагенты.Ссылка.Дата КАК Дата,
	|			Контрагенты.Ссылка.ХозОперация КАК ХозОперация,
	|			Контрагенты.Ссылка.СуммаДокумента КАК СуммаДокумента,
	|			Контрагенты.Ссылка.ВалютаДокумента КАК ВалютаДокумента,
	|			ВЫБОР
	|				КОГДА Контрагенты.Ссылка.ПометкаУдаления
	|					ТОГДА 3
	|				ИНАЧЕ ВЫБОР
	|						КОГДА Контрагенты.Ссылка.Проведен
	|							ТОГДА 1
	|						ИНАЧЕ 0
	|				КОНЕЦ
	|			КОНЕЦ КАК ДанныеКартинки
	|		ИЗ
	|			КритерийОтбора.Renault_Контрагенты(&Контрагент) КАК Контрагенты
	|";
	
	ТекстУсловий = "";
	// Отбор по интервалу времени
	Если ДатаНачала<>Неопределено Тогда
		ТекстУсловий = ТекстУсловий + ?(ТекстУсловий="", "ГДЕ ", " И ") + "Контрагенты.Ссылка.Дата>=&ДатаНачала";	
	КонецЕсли;
	
	Если ДатаОкончания<>Неопределено Тогда
		ТекстУсловий = ТекстУсловий + ?(ТекстУсловий="", "ГДЕ ", " И ") + " Контрагенты.Ссылка.Дата<=&ДатаОкончания";
	КонецЕсли;
	
	Если НЕ обЗначениеНеЗаполнено(Ограничения) Тогда
		// отбор по значению ограничений
		Для Каждого Ограничение Из Ограничения Цикл
			Если СтруктураИсключений.Свойство(Ограничение.Ключ) Тогда
				Продолжить;
			КонецЕсли;
			Если НЕ обЗначениеНеЗаполнено(Ограничение.Значение) Тогда
				ТекстУсловий = ТекстУсловий + ?(ПустаяСтрока(ТекстУсловий), "ГДЕ ", " И ") + "Контрагенты.Ссылка."+Ограничение.Ключ+"=&"+Ограничение.Ключ;
				Запрос.УстановитьПараметр(Ограничение.Ключ,Ограничение.Значение);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	// Отбор по виду документов
	Если (МассивВидовДокументов<>Неопределено) И (МассивВидовДокументов.Количество()<>0) Тогда
		ТекстУсловий = ТекстУсловий + ?(ТекстУсловий="", "ГДЕ (", " И (");
		
		Для Сч=0 По (МассивВидовДокументов.Количество()-1) Цикл  	
			Если Сч<>0 Тогда
				ТекстУсловий = ТекстУсловий + " ИЛИ ";	
			КонецЕсли;
			ТекстУсловий = ТекстУсловий + "Контрагенты.Ссылка ССЫЛКА Документ." + МассивВидовДокументов[Сч];		
		КонецЦикла;	
		
		ТекстУсловий = ТекстУсловий + ")";
	КонецЕсли;
	  	
	ТекстЗапроса = ТекстЗапроса + ТекстУсловий;
	
	ТекстЗапроса = ТекстЗапроса + "
	|) КАК КритерийОтбораКонтрагенты
	|УПОРЯДОЧИТЬ ПО
	|	Дата";
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Контрагент",      Ограничения.Контрагент);
	Запрос.УстановитьПараметр("ДатаНачала",      ДатаНачала); 	
	Запрос.УстановитьПараметр("ДатаОкончания",   ДатаОкончания);
	
	Возврат Запрос.Выполнить().Выгрузить();	
КонецФункции // ЗаполнитьТаблицуДокументами() 

//Преобразует строку  в цвет
Функция ПолучитьЦветПоСтроке(вхСтрокаЦвета) Экспорт
	
	Попытка
		МассивОпределение = обРазложитьСтрокуВМассивПодстрок(вхСтрокаЦвета, "@");
		Если МассивОпределение[0] = "web" Тогда
			Возврат WebЦвета[МассивОпределение[1]];
		ИначеЕсли МассивОпределение[0] = "style" Тогда
			Возврат ЦветаСтиля[МассивОпределение[1]];
		ИначеЕсли МассивОпределение[0] = "RGB" Тогда	
			МассивЦвета = обРазложитьСтрокуВМассивПодстрок(МассивОпределение[1], ",");
			ИтоговыйЦвет = Новый Цвет(МассивЦвета[0], МассивЦвета[1], МассивЦвета[2]);
			Возврат ИтоговыйЦвет;
		Иначе 
			Возврат Новый Цвет();
		КонецЕсли;
	Исключение
		Возврат Новый Цвет();
	КонецПопытки;
	
КонецФункции

Функция ЦветВСтроку(вхЦвет) Экспорт
	ТекИмя = Строка(вхЦвет);	
	Если вхЦвет.Вид = ВидЦвета.WebЦвет Тогда
		Начало = Найти(ТекИмя,"(");
		Конец = Найти(ТекИмя,")");
		ТекИмяОриг = Сред(ТекИмя,Начало+1,Конец - Начало - 1);
		Возврат "web@"+ТекИмяОриг;
	ИначеЕсли  вхЦвет.Вид = ВидЦвета.ЭлементСтиля Тогда
		ТаблицаЦветов = ТаблицаЦветовСтиля();
		Поиск = ТаблицаЦветов.Найти(ТекИмя,"ПредставлениеЦвета");
		Если ЗначениеЗаполнено(Поиск) тогда
			Возврат "style@"+Поиск.ИмяЦвета;
		Иначе
			Возврат "RGB@" +ТекИмя;
		КонецЕсли;
		
	Иначе
		Возврат "RGB@"+ТекИмя;
	КонецЕсли;
	
		
	
КонецФункции

Функция ТаблицаЦветовСтиля()
	Сп = Новый ТаблицаЗначений();
	Сп.Колонки.Добавить("ПредставлениеЦвета") ;
	Сп.Колонки.Добавить("ИмяЦвета");
	Нов = Сп.Добавить();
	Нов.ПредставлениеЦвета =Строка(ЦветаСтиля.АльтернативныйЦветФонаПоля);
	Нов.ИмяЦвета = "АльтернативныйЦветФонаПоля";
	Нов = Сп.Добавить();
	Нов.ПредставлениеЦвета =Строка(ЦветаСтиля.ТекстВторостепеннойНадписи);
	Нов.ИмяЦвета ="ТекстВторостепеннойНадписи";
	Нов = Сп.Добавить();
	Нов.ПредставлениеЦвета =Строка(ЦветаСтиля.ТекстИнформационнойНадписи);
	Нов.ИмяЦвета ="ТекстИнформационнойНадписи";
	Нов = Сп.Добавить();
	Нов.ПредставлениеЦвета =Строка(ЦветаСтиля.ТекстПодвалаТабличногоПоля);
	Нов.ИмяЦвета ="ТекстПодвалаТабличногоПоля";
	Нов = Сп.Добавить();
	Нов.ПредставлениеЦвета =Строка(ЦветаСтиля.ТекстПредупреждающейНадписи);
	Нов.ИмяЦвета ="ТекстПредупреждающейНадписи";
	Нов = Сп.Добавить();
	Нов.ПредставлениеЦвета =Строка(ЦветаСтиля.ТекстШапкиТабличногоПоля);
	Нов.ИмяЦвета = "ТекстШапкиТабличногоПоля";
	Нов = Сп.Добавить();
	Нов.ПредставлениеЦвета =Строка(ЦветаСтиля.ФонГруппировкиВерхнегоУровня);
	Нов.ИмяЦвета = "ФонГруппировкиВерхнегоУровня";
	Нов = Сп.Добавить();
	Нов.ПредставлениеЦвета =Строка(ЦветаСтиля.ФонГруппировкиПромежуточногоУровня);
	Нов.ИмяЦвета = "ФонГруппировкиПромежуточногоУровня";
	Нов = Сп.Добавить();
	Нов.ПредставлениеЦвета =Строка(ЦветаСтиля.ЦветГиперссылки);
	Нов.ИмяЦвета = "ЦветГиперссылки";
	Нов = Сп.Добавить();
	Нов.ПредставлениеЦвета =Строка(ЦветаСтиля.ЦветЛинииОтчета);
	Нов.ИмяЦвета = "ЦветЛинииОтчета";
	Нов = Сп.Добавить();
	Нов.ПредставлениеЦвета =Строка(ЦветаСтиля.ЦветОсобогоТекста);
	Нов.ИмяЦвета = "ЦветОсобогоТекста";
	Нов = Сп.Добавить();
	Нов.ПредставлениеЦвета =Строка(ЦветаСтиля.ЦветОтрицательногоЧисла);
	Нов.ИмяЦвета = "ЦветОтрицательногоЧисла";
	Нов = Сп.Добавить();
	Нов.ПредставлениеЦвета =Строка(ЦветаСтиля.ЦветПоляНерегламентированногоУчета);
	Нов.ИмяЦвета = "ЦветПоляНерегламентированногоУчета";
	Нов = Сп.Добавить();
	Нов.ПредставлениеЦвета =Строка(ЦветаСтиля.ЦветРамки);
	Нов.ИмяЦвета = "ЦветРамки";
	Нов = Сп.Добавить();
	Нов.ПредставлениеЦвета =Строка(ЦветаСтиля.ЦветТекстаВыделенияПоля);
	Нов.ИмяЦвета = "ЦветТекстаВыделенияПоля";
	Нов = Сп.Добавить();
	Нов.ПредставлениеЦвета =Строка(ЦветаСтиля.ЦветТекстаЗаголовкаАРМ);
	Нов.ИмяЦвета = "ЦветТекстаЗаголовкаАРМ";
	Нов = Сп.Добавить();
	Нов.ПредставлениеЦвета =Строка(ЦветаСтиля.ЦветТекстаКнопки);
	Нов.ИмяЦвета = "ЦветТекстаКнопки";
	Нов = Сп.Добавить();
	Нов.ПредставлениеЦвета =Строка(ЦветаСтиля.ЦветТекстаНадписейАРМ);
	Нов.ИмяЦвета = "ЦветТекстаНадписейАРМ";
	Нов = Сп.Добавить();
	Нов.ПредставлениеЦвета =Строка(ЦветаСтиля.ЦветТекстаНаименованияОтчета);
	Нов.ИмяЦвета = "ЦветТекстаНаименованияОтчета";
	Нов = Сп.Добавить();
	Нов.ПредставлениеЦвета =Строка(ЦветаСтиля.ЦветТекстаНаименованияСправочника);
	Нов.ИмяЦвета = "ЦветТекстаНаименованияСправочника";
	Нов = Сп.Добавить();
	Нов.ПредставлениеЦвета =Строка(ЦветаСтиля.ЦветТекстаПодсказки);
	Нов.ИмяЦвета = "ЦветТекстаПодсказки";
	Нов = Сп.Добавить();
	Нов.ПредставлениеЦвета =Строка(ЦветаСтиля.ЦветТекстаПоля);
	Нов.ИмяЦвета = "ЦветТекстаПоля";
	Нов = Сп.Добавить();
	Нов.ПредставлениеЦвета =Строка(ЦветаСтиля.ЦветТекстаУзлаДерева);
	Нов.ИмяЦвета = "ЦветТекстаУзлаДерева";
	Нов = Сп.Добавить();
	Нов.ПредставлениеЦвета =Строка(ЦветаСтиля.ЦветТекстаФормы);
	Нов.ИмяЦвета = "ЦветТекстаФормы";
	
	Нов = Сп.Добавить();
	Нов.ПредставлениеЦвета =Строка(ЦветаСтиля.ЦветФонаВыделенияПоля);
	Нов.ИмяЦвета = "ЦветФонаВыделенияПоля";
	Нов = Сп.Добавить();
	Нов.ПредставлениеЦвета =Строка(ЦветаСтиля.ЦветФонаГруппировкиОтчета1);
	Нов.ИмяЦвета = "ЦветФонаГруппировкиОтчета1";
	Нов = Сп.Добавить();
	Нов.ПредставлениеЦвета =Строка(ЦветаСтиля.ЦветФонаГруппировкиОтчета2);
	Нов.ИмяЦвета = "ЦветФонаГруппировкиОтчета2";
	Нов = Сп.Добавить();
	Нов.ПредставлениеЦвета =Строка(ЦветаСтиля.ЦветФонаКнопки);
	Нов.ИмяЦвета = "ЦветФонаКнопки";
	
	Нов = Сп.Добавить();
	Нов.ПредставлениеЦвета =Строка(ЦветаСтиля.ЦветФонаПодсказки);
	Нов.ИмяЦвета = "ЦветФонаПодсказки";
	Нов = Сп.Добавить();
	Нов.ПредставлениеЦвета =Строка(ЦветаСтиля.ЦветФонаПоля);
	Нов.ИмяЦвета = "ЦветФонаПоля";
	Нов = Сп.Добавить();
	Нов.ПредставлениеЦвета =Строка(ЦветаСтиля.ЦветФонаФормы);
	Нов.ИмяЦвета = "ЦветФонаФормы";
	Нов = Сп.Добавить();
	Нов.ПредставлениеЦвета =Строка(ЦветаСтиля.ЦветФонаШапкиОтчета);
	Нов.ИмяЦвета = "ЦветФонаШапкиОтчета";
	Возврат Сп
	
КонецФункции

#КонецЕсли


//Работа с почтой

Функция Renault_ПолучитьЭлектронныеПисьма(УчетнаяЗапись, АвтоПолучение = Ложь) Экспорт
	// Проверим, а указаны для учетной записи параметры POP3 сервера.
	// Если нет, то информируем об этом пользователя и прерываем получение.
	//Если ПустаяСтрока(УчетнаяЗапись.POP3Сервер) Или ПустаяСтрока(УчетнаяЗапись.Логин) Тогда
	//	#Если Клиент Тогда
	//		Сообщить("Для учетной записи <" + УчетнаяЗапись + "> не указаны параметры POP3 сервера.
	//		|Получение почты невозможно.", СтатусСообщения.Информация);	
	//	#КонецЕсли
	//	Возврат 0;
	//КонецЕсли;
	//
	//КоличествоНовыхПисем = 0;
	//СтруктураРежимовОбмена = Новый Структура("Получить, Отправить", Истина, Ложь);
	//СоединениеСПочтовымСервером = эпПодключитьсяКПочтовомуСерверу(УчетнаяЗапись, СтруктураРежимовОбмена);
	//Если СоединениеСПочтовымСервером = Неопределено Тогда
	//	Возврат КоличествоНовыхПисем;
	//КонецЕсли;
	//
	//Сообщения = эпВыбратьМассивСообщений(СоединениеСПочтовымСервером, УчетнаяЗапись);
	//
	//Если Сообщения.Количество() = 0 Тогда
	//	Возврат КоличествоНовыхПисем;
	//КонецЕсли;
	//
	//
	//Для каждого сообщение из  сообщения Цикл
	//	// если письмо уже загружено, тогда не будем его загружать.
	//	ПустаяСсылка = Документы.ЭлектронноеПисьмо.ПустаяСсылка();
	//	Если НЕ Документы.ЭлектронноеПисьмо.НайтиПоРеквизиту("ИдентификаторПисьма",Сообщение.ИдентификаторСообщения) = ПустаяСсылка Тогда 
	//		Продолжить;
	//	КонецЕсли;	
	//	эпСоздатьПолученноеПисьмо(Сообщение, УчетнаяЗапись);
	//	КоличествоНовыхПисем = КоличествоНовыхПисем + 1;
	//КонецЦикла;
	//
	//эпОтключитьсяОтПочтовогоСервера(СоединениеСПочтовымСервером);
	//
	//Если Не АвтоПолучение Тогда
	//	#Если Клиент Тогда
	//	Если КоличествоНовыхПисем > 0 Тогда
	//		Оповестить("ОбновитьДеревоГрупп", "Пересчитать");
	//	КонецЕсли;
	//	#КонецЕсли
	//КонецЕсли;

	//Возврат КоличествоНовыхПисем;
КонецФункции // эпПолучитьЭлектронныеПисьма()

Функция Renault_ВыбратьМассивСообщений(Соединение, УчетнаяЗапись) Экспорт 
	//#Если Клиент Тогда
	//Состояние("Выполняется обмен с почтовым сервером");
	//#КонецЕсли

	//МассивСообщений = Новый Массив();
	//
	//// получим массив заголовков полученных писем
	//ПолученныеПисьмаУчетнойЗаписи = РегистрыСведений.ЗаголовкиПолученныхПисем.СоздатьМенеджерЗаписи();
	//ПолученныеПисьмаУчетнойЗаписи.УчетнаяЗапись = УчетнаяЗапись;
	//ПолученныеПисьмаУчетнойЗаписи.Прочитать();
	//Если ПолученныеПисьмаУчетнойЗаписи.Выбран() Тогда
	//	МассивПолученныхПисем = ПолученныеПисьмаУчетнойЗаписи.ЗаголовкиПисем.Получить();
	//Иначе
	//	МассивПолученныхПисем = Новый Массив();
	//КонецЕсли;
	//
	//// выгрузим массив заголовков полученных писем в список
	//СписокПолученныхПисем = Новый СписокЗначений;
	//СписокПолученныхПисем.ЗагрузитьЗначения(МассивПолученныхПисем);
	//
	//// получим массив заголовков писем на сервере
	//Попытка
	//	МассивПисемНаСервере = Соединение.ПолучитьЗаголовки();
	//Исключение
	//	обОписаниеОшибки();
	//	Возврат МассивСообщений;
	//КонецПопытки;
	//
	//МассивПолученныхПисем.Очистить();
	//НомерПисьмаВМассиве = 0;
	//Пока НомерПисьмаВМассиве < МассивПисемНаСервере.Количество() Цикл
	//	ПисьмоНаСервере = МассивПисемНаСервере.Получить(НомерПисьмаВМассиве);
	//	МассивПолученныхПисем.Добавить(ПисьмоНаСервере.ИдентификаторСообщения);
	//	ПолученноеПисьмо = СписокПолученныхПисем.НайтиПоЗначению(ПисьмоНаСервере.ИдентификаторСообщения);
	//	// если заголовка нет в списке полученных, добавим заголовок в массив полученных
	//	Если ПолученноеПисьмо = Неопределено Тогда
	//		НомерПисьмаВМассиве = НомерПисьмаВМассиве + 1;
	//	// если заголовок есть в списке полученных, удалим заголовок из массива писем на сервере
	//	Иначе
	//		МассивПисемНаСервере.Удалить(НомерПисьмаВМассиве);
	//		СписокПолученныхПисем.Удалить(ПолученноеПисьмо);
	//	КонецЕсли;
	//КонецЦикла;
	//
	//Если Не МассивПисемНаСервере.Количество() = 0 Тогда
	//	Попытка
	//		Сообщения = Соединение.Выбрать(УчетнаяЗапись.УдалятьСообщенияССервера, МассивПисемНаСервере);
	//	Исключение
	//		обОписаниеОшибки();
	//		Возврат МассивСообщений;
	//	КонецПопытки;
	//	
	//	// сохраним  массив полученных писем
	//	ХранилищеПолученныхПисем = Новый ХранилищеЗначения(МассивПолученныхПисем);
	//	ПолученныеПисьмаУчетнойЗаписи.УчетнаяЗапись = УчетнаяЗапись;
	//	ПолученныеПисьмаУчетнойЗаписи.ЗаголовкиПисем = ХранилищеПолученныхПисем;
	//	ПолученныеПисьмаУчетнойЗаписи.Записать();
	//	
	//	КоличествоСообщений = Сообщения.Количество();
	//	
	//	Для каждого Сообщение Из Сообщения Цикл
	//		
	//		СтруктураСообщения = Новый Структура;

	//		СтруктураСообщения.Вставить("ИмяОтправителя",Сообщение.ИмяОтправителя);
	//		СтруктураСообщения.Вставить("АдресОтправителя",Сообщение.Отправитель.Адрес);	
	//		СтруктураСообщения.Вставить("Тема",Сообщение.Тема);
	//		
	//		ХТМЛ_Текст = "";
	//		Простой_Текст = "";
	//		Прочий_Текст = "";
	//		
	//		Для каждого ТекстПочтовогоСообщения Из Сообщение.Тексты Цикл
	//			Если ТекстПочтовогоСообщения.ТипТекста = ТипТекстаПочтовогоСообщения.HTML Тогда
	//				ХТМЛ_Текст = ТекстПочтовогоСообщения.Текст;
	//			ИначеЕсли ТекстПочтовогоСообщения.ТипТекста = ТипТекстаПочтовогоСообщения.ПростойТекст Тогда
	//				Простой_Текст = ТекстПочтовогоСообщения.Текст;
	//			Иначе
	//				Прочий_Текст = ТекстПочтовогоСообщения.Текст;
	//			КонецЕсли; 
	//		КонецЦикла;
	//	
	//		Если НЕ обЗначениеНеЗаполнено(ХТМЛ_Текст) Тогда
	//			НовыйHTMLДокумент = Новый COMОбъект("HtmlFile");
	//			НовыйHTMLДокумент.open("text/html");
	//			НовыйHTMLДокумент.write(ХТМЛ_Текст);
	//			НовыйHTMLДокумент.close();
	//			ТегиКартинок = НовыйHTMLДокумент.all.tags("img");
	//			Для а = 0 По ТегиКартинок.length - 1 Цикл
	//				ИсточникКартинки = ТегиКартинок.item(а).src;
	//				Если Найти(ИсточникКартинки, "cid:") = 1 Тогда
	//					ИсточникКартинки = Сред(ИсточникКартинки, 5);
	//					ТегиКартинок.item(а).src = ИсточникКартинки;
	//				КонецЕсли;
	//			КонецЦикла;
	//			ТекстПисьма = НовыйHTMLДокумент.all.tags("html").item(0).outerHTML;
	//			ТипТекста   = Перечисления.ФорматТекста.HTML;
	//		ИначеЕсли НЕ обЗначениеНеЗаполнено(Простой_Текст) Тогда
	//			ТекстПисьма = СтрЗаменить(Простой_Текст, Символ(13), "");
	//			ТипТекста   = Перечисления.ФорматТекста.ПростойТекст;
	//		ИначеЕсли НЕ обЗначениеНеЗаполнено(Прочий_Текст) Тогда
	//			ТекстПисьма = Прочий_Текст;
	//			ТипТекста   = Перечисления.ФорматТекста.ПростойТекст;
	//		КонецЕсли; 
	//			
	//		СтруктураСообщения.Вставить("ТипТекста" , ТипТекста);
	//		СтруктураСообщения.Вставить("Текст" , ТекстПисьма);
	//		СтруктураСообщения.Вставить("КоличествоВложений", Сообщение.Вложения.Количество());
	//		
	//		СтруктураСообщения.Вставить("Вложения",Сообщение.Вложения);
	//		СтруктураСообщения.Вставить("Получатели",Сообщение.Получатели);
	//		СтруктураСообщения.Вставить("Копии", Сообщение.Копии);
	//		
	//		СтруктураСообщения.Вставить("ДатаОтправления", Сообщение.ДатаОтправления);
	//		СтруктураСообщения.Вставить("ДатаПолучения", Сообщение.ДатаПолучения);

	//		СтруктураСообщения.Вставить("ИдентификаторСообщения",Сообщение.ИдентификаторСообщения);
	//		
	//		СтруктураСообщения.Вставить("Важность",Сообщение.Важность);
	//		СтруктураСообщения.Вставить("УведомитьОПрочтении",Сообщение.УведомитьОПрочтении);
	//		
	//		
	//		МассивСообщений.Добавить(СтруктураСообщения);
	//		
	//	КонецЦикла; 
	//КонецЕсли;
	//
	//Возврат МассивСообщений;
КонецФункции // эпВыбратьМассивСообщений()
